# coding: utf-8

# 400000000 10000000
# 100000000  5000000
# 100000      101010
# 30000000   3330000
# 1000000     100000
# 100000       10000
# 3000           100
# 300             10

# 100円のクジを買い続けるとどうなるかを計算

# ちょっと前提がおかしい。一度に買ったもの全体でやらないと...

def ret
  val = rand
  if val < 1.0 / 10000000
    4 * 10000 * 10000 # 4億
  elsif val < 1.0 / 5000000
    1 * 10000 * 10000 # 1億
  elsif val < 1.0 / 3330000
    3000 * 10000      # 3000万
  elsif val < 1.0 / 100000
    100 * 10000       # 100万
  elsif val < 1.0 / 101010
    10 * 10000        # 10万
  elsif val < 1.0 / 10000
    10 * 10000        # 10万
  elsif val < 1.0 / 100
    3000              # 3000
  elsif val < 1.0 / 10
    300               #3000
  else
    0
  end
end

def try(n) # n枚買ったとき
  total = 0
  n.times {
    total += ret
  }
  total
end

#puts 4 * 10000 * 10000 / 10000000.0 +
#     1 * 10000 * 10000 / 5000000.0 +
#     3000 * 10000 / 3330000.0 +
#     100 * 10000 / 100000.0 +
#     10 * 10000 / 101010.0 +
#     10 * 10000 / 10000.0 +
#     3000 / 100.0 +
#     300 / 10.0 +
#     0

total = 0
count = 10000
victory = 0
count.times {
  t = try(100)
  puts t
  total += t
  victory += 1 if t > 30000
}
puts "------"
puts total / count
puts victory
